; domain
(define (domain clean-room)
(:predicates (room ?r) (moppingrobot ?a) (clean ?r) (dirty ?r) (at ?a ?r) (near ?r1 ?r2))

(:action move
 :parameters (?a ?from ?to)
 :precondition (and (at ?a ?from)
                    (moppingrobot ?a)
                    (room ?from)
                    (room ?to)
                    (near ?from ?to))
 :effect (and (at ?a ?to)
              (not (at ?a ?from))))

(:action suck
 :parameters (?a ?p)
 :precondition (and (at ?a ?p)
                    (moppingrobot ?a)
                    (room ?p)
                    (dirty ?p) )
 :effect (and (clean ?p))))

; problem
(define (problem clean-room-problem)
(:domain clean-room)
(:objects Agent P1 P2 P3 P4)

(:init (room P1)
       (room P2)
       (room P3)
       (room P4)
       (moppingrobot Agent)
       (clean P1) (dirty P2)
       (dirty P3)
       (dirty P4)
       (at Agent P1)
       (near P1 P2)
       (near P1 P3)
       (near P2 P1)
       (near P2 P4)
       (near P3 P1)
       (near P3 P4)
       (near P4 P2)
       (near P4 P3))

(:goal (and (clean P1)
            (clean P2)
            (clean P3)
            (clean P4)
            (at Agent P1))))

; plan
1. (move agent p1 p2)
   deleted: (at agent p1)
   added: (at agent p2)
   goals met: 1 of 5
2. (suck agent p2)
   added: (clean p2)
   goals met: 2 of 5
3. (move agent p2 p4)
   deleted: (at agent p2)
   added: (at agent p4)
   goals met: 2 of 5
4. (suck agent p4)
   added: (clean p4)
   goals met: 3 of 5
5. (move agent p4 p3)
   deleted: (at agent p4)
   added: (at agent p3)
   goals met: 3 of 5
6. (suck agent p3)
   added: (clean p3)
   goals met: 4 of 5
7. (move agent p3 p1)
   deleted: (at agent p3)
   added: (at agent p1)
   goals met: 5 of 5
